**Data Preprocessing**

    1. Missing Value Replenishment
    2. Merging data files
    3. Appending the data files
    4. Transformation or normalization
    5. Random Sampling

**Missing Value Replenishment**

In [1]:
#Read the data
import pandas as pd
data = pd.read_excel('/Users/sudiptarakshit/Desktop/Python/Prof Boby John Module/Dataset/Preprocessing_Data_I.xlsx')
#Explore the data
data.head()
#Check the structure of the data
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   SL No             20 non-null     int64
 1   Reviewer_Skill    20 non-null     int64
 2   Review_Type       20 non-null     int64
 3   Domain_Knowledge  20 non-null     int64
 4   Review_Time       19 non-null     float64
 5   Test_Coverage     19 non-null     float64
 6   Review_Coverage   19 non-null     float64
 7   Reuse             20 non-null     int64
 8   Review_Rate       20 non-null     int64
 9   Sprint_Prod       20 non-null     float64
dtypes: float64(4), int64(6)
memory usage: 1.7 KB

In [2]:
#count the data
data.count()

SL No               20
Reviewer_Skill      20
Review_Type         20
Domain_Knowledge    20
Review_Time         19
Test_Coverage       19
Review_Coverage     19
Reuse               20
Review_Rate         20
Sprint_Prod         20
dtype: int64

We conclude that missing value is present in the data

Columns having missing value - Review_Time, Test_Coverage, Review_Coverage

In [3]:
#Delete records with missing value
newdata = data.dropna()

In [4]:
#Check the structure of the newdata
newdata.count()

SL No               18
Reviewer_Skill      18
Review_Type         18
Domain_Knowledge    18
Review_Time         18
Test_Coverage       18
Review_Coverage     18
Reuse               18
Review_Rate         18
Sprint_Prod         18
dtype: int64

In [6]:
#We export the cleaned up data
newdata.to_excel('newdata.xlsx')

Instead of deleting the missing values, we can replenish them: imputation

Replacing missing values in Review_Time with Mean_Review_Time

In [7]:
# Compute the mean
rev_time = data.Review_Time
rev_time_mean = round(rev_time.mean(),3)

In [8]:
#Replace missing value with mean
rev_time.fillna(rev_time_mean,inplace=True)

Replacing missing values in Test_Coverage with Median_Test_Coverage

In [9]:
# Compute the median
Test_Coverage = data.Test_Coverage
Test_Coverage_median = round(Test_Coverage.median(),3)

In [10]:
# Replacing the missing value with median
Test_Coverage.fillna(Test_Coverage_median,inplace=True)

Replacing the missing value in Review_Coverage with 95

In [11]:
Review_Coverage = data.Review_Coverage
#Replacing missing value with 95
Review_Coverage.fillna(95,inplace=True)

In [12]:
#We export the cleaned up data
data.to_excel('data.xlsx')

**Merging data files**

In [54]:
#Import the package
import pandas as pd

In [17]:
#Import the dataset - features
features = pd.read_csv('Mail_Respond_Features.csv')
features.head()

   SL_No  District     House_Type Income Previous_Customer
0      1  Suburban       Detached   High                No
1      2  Suburban       Detached   High               Yes
2      3     Rural       Detached   High                No
3      4     Urban  Semi-detached   High                No
4      5     Urban  Semi-detached    Low                No

In [14]:
#Import the dataset - responses
response = pd.read_csv('Mail_Respond_Response.txt',sep='\t')
#For importing text file also, we can use read_csv

In [16]:
response.head()

   SL_No Outcome
0      1      No
1      2      No
2      3     Yes
3      4     Yes
4      5     Yes

In [18]:
#Merging the datasets
data = pd.merge(features,response ,on = 'SL_No')

In [19]:
data.head()

   SL_No  District     House_Type Income Previous_Customer Outcome
0      1  Suburban       Detached   High                No      No
1      2  Suburban       Detached   High               Yes      No
2      3     Rural       Detached   High                No     Yes
3      4     Urban  Semi-detached   High                No     Yes
4      5     Urban  Semi-detached    Low                No     Yes

In [21]:
#Export merged file to system
data.to_excel('mergedata.xlsx')

**Appending the data files**

In [62]:
#Import the package
import pandas as pd

In [22]:
#Import the dataset 1
preprop_data1 = pd.read_excel('Preprocessing_Data_I.xlsx')

In [23]:
#Import the dataset 2
preprop_data2 = pd.read_csv('Preprocessing_Data_II.csv')

In [24]:
#we check the dataset1
preprop_data1.head()

,SL No,Reviewer_Skill,Review_Type,Domain_Knowledge,Review_Time,Test_Coverage,Review_Coverage,Reuse,Review_Rate,Sprint_Prod
0,1,4,1,4,30.0,100.0,70.0,30,3,0.46
1,2,5,2,5,20.0,70.0,100.0,15,1,0.08
2,3,4,1,4,20.0,70.0,100.0,15,2,0.11
3,4,4,1,4,30.0,70.0,70.0,50,4,0.73
4,5,5,2,5,NaN,100.0,NaN,50,4,0.50

*some missing values present*

In [25]:
#Data count
preprop_data1.count()

SL No               20
Reviewer_Skill      20
Review_Type         20
Domain_Knowledge    20
Review_Time         19
Test_Coverage       19
Review_Coverage     19
Reuse               20
Review_Rate         20
Sprint_Prod         20
dtype: int64

In [26]:
#we check the dataset2
preprop_data2.head()

,SL No,Reviewer_Skill,Review_Type,Domain_Knowledge,Review_Time,Test_Coverage,Review_Coverage,Reuse,Review_Rate,Sprint_Prod
0,21,5,2,5,20.0,50,50.0,50.0,3,0.54
1,22,3,1,3,20.0,100,70.0,10.0,2,0.18
2,23,4,1,4,20.0,100,NaN,10.0,3,0.37
3,24,4,1,4,20.0,100,70.0,20.0,3,0.47
4,25,3,1,3,NaN,100,70.0,25.0,1,0.37

*some missing values present*

In [27]:
#Data count
preprop_data2.count()

SL No               14
Reviewer_Skill      14
Review_Type         14
Domain_Knowledge    14
Review_Time         13
Test_Coverage       14
Review_Coverage     13
Reuse               13
Review_Rate         14
Sprint_Prod         14
dtype: int64

In [28]:
# we append the two datasets
#For appending, column names should be same
data = preprop_data1.append(preprop_data2)

/var/folders/n7/h1_p91d52lbbxr83fp28f6pm0000gn/T/ipykernel_1480/1969568602.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data = preprop_data1.append(preprop_data2)

In [30]:
#data count
data.count()

SL No               34
Reviewer_Skill      34
Review_Type         34
Domain_Knowledge    34
Review_Time         32
Test_Coverage       33
Review_Coverage     32
Reuse               33
Review_Rate         34
Sprint_Prod         34
dtype: int64

In [31]:
#Exporting the appended dataset 
data.to_excel('appendnewdata.xlsx')

**Transformation or normalization**

In [32]:
#Import the packages
import pandas as pd
from sklearn.preprocessing import StandardScaler as z
from sklearn.preprocessing import MinMaxScaler as MinMax

### Z Transformation

In [33]:
#Import the dataset
data = pd.read_excel('TAT.xlsx')

In [34]:
# Explore the dataset
data.head()

   Volume  KDEB_Usage   Skill   Effort  TAT
0      38          13      3.6     382  791
1      64          10      3.6     402  815
2      45          12      3.6     369  655
3      52          10      3.6     529  480
4      28           9      3.6     529  453

In [35]:
# Descriptive summary
round(data.describe(),2)

       Volume  KDEB_Usage   Skill   Effort     TAT
count   24.00       24.00    24.00   24.00   24.00
mean    31.62       14.08     3.74  261.25  638.92
std     11.17        4.16     0.24  115.73  150.07
min     18.00        9.00     3.25  125.00  399.00
25%     23.00       10.00     3.60  181.75  504.00
50%     29.00       14.00     3.70  218.00  653.50
75%     36.50       17.75     4.00  351.75  774.50
max     64.00       20.00     4.00  529.00  883.00

In [36]:
# Scaling using Z transform
zdata = z().fit_transform(data)

In [38]:
# Converting transformed data to data frame format
zdata = pd.DataFrame(data=zdata,columns=data.columns)

In [39]:
# Explore the transformed data
zdata.head()

     Volume  KDEB_Usage    Skill     Effort       TAT
0  0.583006   -0.266083 -0.601041  1.065798  1.035218
1  2.960757   -1.002928 -0.601041  1.242327  1.198583
2  1.223170   -0.511698 -0.601041  0.951053  0.109478
3  1.863334   -1.002928 -0.601041  2.363290 -1.081732
4 -0.331513   -1.248543 -0.601041  2.363290 -1.265518

In [40]:
#Descriptive summary of the transformed data
round(zdata.describe(),3)

       Volume  KDEB_Usage   Skill   Effort     TAT
count  24.000      24.000   24.000  24.000  24.000
mean    0.000      -0.000   -0.000   0.000   0.000
std     1.022       1.022    1.022   1.022   1.022
min    -1.246      -1.249   -2.086  -1.203  -1.633
25%    -0.789      -1.003   -0.601  -0.702  -0.918
50%    -0.240      -0.020   -0.177  -0.382   0.099
75%     0.446       0.901    1.096   0.799   0.923
max     2.961       1.453    1.096   2.363   1.661

In [41]:
zdata.to_excel('ztransform.xlsx')

### Min-Max Transformation

X scaled = (X - X min)/(X max - X min)

In [42]:
# Min-Max transformation
minmaxdata = MinMax().fit_transform(data)

In [44]:
# Convert transformed data to data frame format
minmaxdata = pd.DataFrame(minmaxdata,columns=data.columns)

In [45]:
#Explore the min-max data
minmaxdata.head()

     Volume  KDEB_Usage    Skill     Effort       TAT
0  0.434783    0.363636  0.466667  0.636139  0.809917
1  1.000000    0.090909  0.466667  0.685644  0.859504
2  0.586957    0.272727  0.466667  0.603960  0.528926
3  0.739130    0.090909  0.466667  1.000000  0.167355
4  0.217391    0.000000  0.466667  1.000000  0.111570

In [46]:
#Descriptive summary of minmaxdata
round(minmaxdata.describe(),3)

       Volume  KDEB_Usage   Skill   Effort     TAT
count  24.000      24.000   24.000  24.000  24.000
mean    0.296       0.462    0.656   0.337   0.496
std     0.243       0.378    0.321   0.286   0.310
min     0.000       0.000    0.000   0.000   0.000
25%     0.109       0.091    0.467   0.140   0.217
50%     0.239       0.455    0.600   0.230   0.526
75%     0.402       0.795    1.000   0.561   0.776
max     1.000       1.000    1.000   1.000   1.000